Revit 2027 API
BuiltInFailures.RebarFailures.BarDiameterTooLarge Property
 Rebar Bar Diameter is too large.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BarDiameterTooLarge { get; }
Public Shared ReadOnly Property BarDiameterTooLarge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BarDiameterTooLarge {
	FailureDefinitionId^ get ();
}
static member BarDiameterTooLarge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace